Repository: mortza-mansory/Asset_Managment
Catalog: lib/feature/localization/l10n/app_*.arb
Languages: fa

# returnAssetButton
source: Return Asset
fa: بازگرداندن دارایی

source: Loan to:
fa: امانت به:

source: Loan from:
fa: امانت از:

source: Return Date
fa: تاریخ بازگشت

source: Overdue
fa: دیرکرد

# giveLoanFAB
source: Give Loan
fa: اعطای وام

# receiveLoanFAB
source: Receive Loan
fa: دریافت وام

# scanToSelectAsset
source: Scan Asset Tag
fa: اسکن تگ دارایی

# scanToSelectRecipient
source: Scan User Code
fa: اسکن کد کاربر

source: Asset Selected
fa: دارایی انتخاب شد

# recipientSelected
source: Recipient Specified
fa: تحویل‌گیرنده مشخص شد

# receiveLoanTitle
source: Receive Loan
fa: دریافت امانت

# receiveLoanSubtitle
source: To receive a loaned asset, ask the person to scan your QR code.
fa: برای دریافت دارایی امانت‌داده‌شده، از شخص بخواهید کد QR شما را اسکن کند.

source: Your unique code:
fa: کد منحصربه‌فرد شما:

# scanButton
source: Scan
fa: اسکن

# scanPageTitleRfid
source: Scan RFID Tag
fa: اسکن تگ RFID

# scanPageTitleQr
source: Scan QR Code
fa: اسکن QR Code

# scanPageSearchingRfid
source: Searching for RFID Tag...
fa: در جستجوی تگ RFID...

# scanPageSearchingQr
source: Point the camera at the QR Code...
fa: دوربین را به سمت QR Code بگیرید...

# emailTextField
source: Email
fa: ایمیل

# myCompaniesButton
source: View My Organizations
fa: مشاهده سازمان‌های من

# logoutDialogTitle
source: Logout
fa: خروج از حساب

# logoutDialogContent
source: Are you sure you want to log out of your account?
fa: آیا برای خروج از حساب کاربری خود مطمئن هستید؟

# logoutDialogConfirm
source: Yes, Logout
fa: بله، خارج شو

# logoutDialogCancel
source: Cancel
fa: انصراف

# subscriptionNotActive
source: Your subscription is not active yet. Please try again after a few moments.
fa: اشتراک شما هنوز فعال نشده است. لطفاً پس از چند لحظه دوباره تلاش کنید.

# copyLinkButton
source: Copy Link
fa: کپی لینک

# linkCopiedSnackbar
source: Link copied successfully to clipboard!
fa: لینک با موفقیت در کلیپ‌بورد کپی شد!

# goToSwitchCompanyButton
source: Go to Company Selection
fa: رفتن به انتخاب شرکت

# companyRoleOperator
source: Operator
fa: اپراتور

# refreshCompaniesTooltip
source: Refresh companies
fa: تازه‌سازی شرکت‌ها

# createNewCompanyTooltip
source: Create new company
fa: ایجاد شرکت جدید

source: No companies found
fa: هیچ شرکتی یافت نشد

# errorLoadingCompanies
source: Failed to load companies: {message}
fa: خطا در بارگذاری شرکت‌ها: {message}

# createNewCompanyButton
source: Create New Company
fa: ایجاد شرکت جدید

# retryButton
source: Retry
fa: تلاش مجدد

# confirmDeleteTitle
source: Delete Company
fa: حذف شرکت

# confirmDeleteMessage
source: Are you sure you want to delete {companyName}?
fa: آیا مطمئن هستید که می‌خواهید شرکت {companyName} را حذف کنید؟

# cancelButton
source: Cancel
fa: لغو

# deleteButton
source: Delete
fa: حذف

# companyDeletedSnackbar
source: Company deleted successfully
fa: شرکت با موفقیت حذف شد

# editCompanyTooltip
source: Edit company
fa: ویرایش شرکت

# updateCompanyTitle
source: Update Company
fa: به‌روزرسانی شرکت

# updateCompanySubtitle
source: Update the details of your company below.
fa: جزئیات شرکت خود را در زیر به‌روزرسانی کنید.

# updateCompanyAction
source: Update Company
fa: به‌روزرسانی شرکت

# companyUpdatedSnackbar
source: Company {companyName} updated successfully
fa: شرکت {companyName} با موفقیت به‌روزرسانی شد

# errorOperation
source: Error: {message}
fa: خطا: {message}

# switchButton
source: Switch
fa: تغییر

# editCompanyButton
source: Update
fa: به‌روزرسانی

# companySettingsTitle
source: Company Settings
fa: تنظیمات شرکت

# companySettingsUsersTab
source: Users
fa: کاربران

# companySettingsDetailsTab
source: Details
fa: جزئیات

# companySettingsExportTab
source: Export
fa: خروجی

# aboutAppTitle
source: About App
fa: درباره برنامه

# aboutAppVersion
source: Version
fa: نسخه

# aboutAppDeveloper
source: Developer
fa: توسعه دهنده

# aboutAppDescription
source: This application is designed for smart asset management using RFID technology, helping organizations to track and manage their assets efficiently.
fa: این برنامه برای مدیریت هوشمند اموال با استفاده از فناوری RFID طراحی شده است و به سازمان‌ها کمک می‌کند تا دارایی‌های خود را به طور کارآمد ردیابی و مدیریت کنند.

# roleOwner
source: Owner
fa: مالک

# roleAdmin
source: Admin
fa: مدیر

# roleOperator
source: Operator
fa: اپراتور

# profileApplicationAction
source: Application Actions
fa: اقدامات برنامه

# profileSubscriptionPlan
source: Subscription Plan
fa: پلن اشتراک

# noActiveSubscription
source: No Active Plan
fa: بدون پلن فعال

# planExpiresOn
source: Expires on {date}
fa: تاریخ انقضا: {date}

# companyDetailsUserCount
source: Total Users
fa: تعداد کل کاربران

# companyDetailsAssetsCount
source: Total Assets
fa: تعداد کل اموال

# companyDetailsStatus
source: Status
fa: وضعیت

# companyStatusActive
source: Active
fa: فعال

# companyStatusInactive
source: Inactive
fa: غیرفعال

# exportDataButton
source: Export All Data (Excel)
fa: خروجی تمام اطلاعات (اکسل)

# exportDataDescription
source: Generate and download a complete report of your company's users and assets.
fa: یک گزارش کامل از کاربران و اموال شرکت خود ایجاد و دانلود کنید.

# companyMembersTitle
source: Manage Members
fa: مدیریت اعضا

# companyMembersAddUser
source: Add User
fa: افزودن کاربر

# companyMembersChangeRole
source: Change Role
fa: تغییر نقش

# companyMembersRemoveUser
source: Remove User
fa: حذف کاربر

# companyMembersConfirmRemove
source: Are you sure you want to remove {username}?
fa: آیا از حذف {username} اطمینان دارید؟

# companyMembersConfirm
source: Confirm
fa: تایید

# userStatusActive
source: Active
fa: فعال

# userStatusPending
source: Pending
fa: در انتظار

# userStatusRemoved
source: Removed
fa: حذف شده

# joinedOn
source: Joined on {date}
fa: عضو شده در {date}

# invitedBy
source: Invited by {username}
fa: دعوت شده توسط {username}

# noMembersFound
source: No members found in this company.
fa: هیچ عضوی در این شرکت یافت نشد.

source: Loading members...
fa: در حال بارگذاری اعضا...

# noPermissionToManageOwner
source: You don't have promission to modify the owenr role.
fa: شما اجازه تغییر در نقش مالک را ندارید.

# categoryAll
source: All
fa: همه

# categoryOfficeSupplies
source: Office Supplies
fa: لوازم اداری

# assetStatusMaintenance
source: Maintenance
fa: در دست تعمیر

# assetStatusDisposed
source: Disposed
fa: سلب مالکیت شده

# assetStatusOnLoan
source: On Loan
fa: در امانت

# assetAddAsset
source: Add Asset
fa: افزودن اموال

source: Try Again
fa: تلاش مجدد

source: Loading data...
fa: در حال بارگذاری اطلاعات...

# categoryManagementTitle
source: Category Management
fa: مدیریت دسته‌بندی‌ها

# categoryEditTitle
source: Edit Category '{categoryName}'
fa: ویرایش دسته‌بندی '{categoryName}'

# categoryNameLabel
source: Category Name
fa: نام دسته‌بندی

# categoryCodeLabel
source: Category Code
fa: کد دسته‌بندی

# categoryDescriptionLabel
source: Description
fa: توضیحات

# categoryIconNameLabel
source: Icon Name (MaterialIcons)
fa: نام آیکون (MaterialIcons)

# categoryColorHexLabel
source: Color Hex (#RRGGBB)
fa: کد رنگ هگز (#RRGGBB)

# saveButton
source: Save
fa: ذخیره

# categoryUpdateSuccess
source: Category '{categoryName}' updated successfully!
fa: دسته‌بندی '{categoryName}' با موفقیت به‌روز شد!

# categoryEditTooltip
source: Edit Category
fa: ویرایش دسته‌بندی

# categoryManagementSupportMessage
source: For more advanced changes like adding/deleting categories, custom icons, or complex color management, please contact software support.
fa: برای تغییرات پیشرفته‌تر مانند افزودن/حذف دسته‌بندی‌ها، آیکون‌های سفارشی یا مدیریت رنگ پیچیده، لطفاً با پشتیبانی نرم‌افزار تماس بگیرید.

# loanReturnedSuccessfully
source: Loan {loanId} successfully returned.
fa: وام {loanId} با موفقیت بازگردانده شد.

# noMyLoans
source: You have no outstanding loans.
fa: شما هیچ وامی دریافت نکرده‌اید.

source: No loaned out assets
fa: هیچ دارایی امانت داده‌شده‌ای یافت نشد

# loadLoansInitialText
source: Loading loans...
fa: در حال بارگذاری وام‌ها...

source: No Return Date
fa: تاریخ بازگشت ندارد

source: Unknown error
fa: خطای ناشناخته

source: Invalid QR code for user
fa: کد QR برای کاربر نامعتبر است

# loanCreatedSuccessfully
source: Loan {loanId} created successfully
fa: وام {loanId} با موفقیت ایجاد شد

# selectAssetRequired
source: Please select an asset
fa: لطفاً یک دارایی انتخاب کنید

# selectRecipientRequired
source: Please select a recipient
fa: لطفاً یک گیرنده انتخاب کنید

# selectReturnDateRequired
source: Please select a return date
fa: لطفاً تاریخ بازگشت را انتخاب کنید

source: Creating Loan...
fa: در حال ایجاد وام...

source: Unknown user
fa: کاربر ناشناس

# noUserIdForQr
source: User ID not available for QR code generation.
fa: شناسه کاربری برای تولید کد QR در دسترس نیست.

# qrCodeError
source: QR code generation error: {err}
fa: خطا در تولید کد QR: {err}

source: Loan
fa: امانتی

# assetEventTypeScanned
source: Scanned
fa: اسکن شد

# assetEventTypeMoved
source: Moved
fa: جا‌به‌جا شد

# assetEventTypeAssigned
source: Assigned
fa: تخصیص داده شد

# assetEventTypeRegistered
source: Registered
fa: ثبت شد

# assetEventTypeLoaned
source: Loaned
fa: به امانت داده شد

# assetEventTypeReturned
source: Returned
fa: بازگردانده شد

# historyNoEventsFound
source: No events found for this filter.
fa: هیچ رویدادی برای این فیلتر یافت نشد.

# historyFilterScan
source: Scan
fa: اسکن

# historyFilterCustodianChange
source: Custodian Change
fa: تغییر امانت‌گیرنده

# historyFilterStatusChange
source: Status Change
fa: تغییر وضعیت

source: Loans Management
fa: مدیریت وام‌ها

# selectAction
source: Select an Action
fa: انتخاب یک عملیات

source: Cancel
fa: لغو

source: Asset Details
fa: جزئیات دارایی

source: Name
fa: نام

source: Status
fa: وضعیت

source: Description
fa: توضیحات

source: My Loans
fa: وام‌های من

source: Loaned Out Assets
fa: دارایی‌های امانت داده‌شده

source: No loans found
fa: هیچ وامی یافت نشد

source: Recipient
fa: گیرنده

source: Start Date
fa: تاریخ شروع

# endDate
source: Return Date
fa: تاریخ بازگشت

source: Return Asset
fa: بازگشت دارایی

# rfidTagLabel
source: RFID Tag
fa: تگ RFID

# rfidTagRequired
source: RFID Tag is required
fa: تگ RFID الزامی است

# invalidAssetIdFormat
source: Asset ID must be a number.
fa: شناسه دارایی باید یک عدد باشد.

source: Unknown Recipient
fa: گیرنده ناشناس

# bulk_upload_guidance_title
source: Bulk Asset Upload Guidance
fa: راهنمای آپلود انبوه دارایی

# bulk_upload_guidance_description
source: To upload assets in bulk, please use the provided Excel template. Ensure your data adheres to the specified format.
fa: برای آپلود انبوه دارایی‌ها، لطفاً از قالب اکسل ارائه شده استفاده کنید. مطمئن شوید که داده‌های شما با فرمت مشخص شده مطابقت دارد.

# required_fields
source: Required Fields (Must be filled):
fa: فیلدهای ضروری (باید پر شوند):

source: Optional Fields:
fa: فیلدهای اختیاری:

# download_template_button
source: Download Excel Template
fa: دانلود قالب اکسل

# template_download_success
source: Excel template downloaded successfully!
fa: قالب اکسل با موفقیت دانلود شد!

# bulk_upload_category_note
source: Note: If a 'Category Name' does not exist, it will be automatically created.
fa: توجه: اگر 'نام دسته‌بندی' وجود نداشته باشد، به صورت خودکار ایجاد خواهد شد.

# bulk_upload_status_note
source: Note: The 'Status' field should contain one of the following values: ACTIVE, IN_REPAIR, IN_USE, LOST, RETIRED. If left empty or invalid, it will default to 'ACTIVE'.
fa: توجه: فیلد 'وضعیت' باید یکی از مقادیر زیر را داشته باشد: ACTIVE, IN_REPAIR, IN_USE, LOST, RETIRED. در صورت خالی بودن یا نامعتبر بودن، به صورت پیش‌فرض 'ACTIVE' خواهد بود.

# bulk_upload_title
source: Bulk Asset Upload
fa: آپلود انبوه دارایی

# bulk_upload_instructions
source: Select an Excel file (.xls or .xlsx) to upload your assets.
fa: یک فایل اکسل (.xls یا .xlsx) را برای آپلود دارایی‌های خود انتخاب کنید.

# select_file_button
source: Select File
fa: انتخاب فایل

# upload_file_button
source: Upload File
fa: آپلود فایل

source: Selected File
fa: فایل انتخاب شده

# no_file_selected_error
source: Please select an Excel file first.
fa: لطفا ابتدا یک فایل اکسل را انتخاب کنید.

source: No file chosen
fa: فایلی انتخاب نشده است

# upload_success_message
source: Assets uploaded successfully!
fa: دارایی‌ها با موفقیت آپلود شدند!

# upload_summary_title
source: Upload Summary
fa: خلاصه آپلود

source: Total Rows Processed
fa: تعداد ردیف‌های پردازش شده

source: Successful Uploads
fa: آپلودهای موفق

source: Failed Uploads
fa: آپلودهای ناموفق

# upload_failed_title
source: Upload Failed
fa: آپلود ناموفق

source: Error Message
fa: پیام خطا

source: Unknown error
fa: خطای نامشخص

# bulk_upload_banner_title
source: Quick Tip: Bulk Upload!
fa: نکته سریع: آپلود انبوه!

# bulk_upload_banner_message
source: Save time by uploading multiple assets at once using our Excel template. Download the template below!
fa: با استفاده از قالب اکسل ما، چندین دارایی را به طور همزمان آپلود کنید و در زمان صرفه‌جویی کنید. قالب را از پایین دانلود کنید!

# hide_banner_button
source: Don't show this again
fa: دیگر این پیام را نشان نده

source: Go to Upload Page
fa: برو به صفحه آپلود

# template_download_started_in_browser
source: Excel template download started in your browser.
fa: دانلود قالب اکسل در مرورگر شما آغاز شد.

# could_not_launch_download_link
source: Could not launch the download link. Please try again or check your internet connection.
fa: لینک دانلود قابل باز شدن نیست. لطفاً دوباره تلاش کنید یا اتصال اینترنت خود را بررسی کنید.
