Repository: mortza-mansory/Asset_Managment
Catalog: lib/feature/localization/l10n/app_*.arb
Languages: fa

# modalWelcomeTitle
source: Welcome to the Smart Asset Management System!
fa: به سامانه هوشمند اموال داری !خوش آمدید

# modalWelcomeSubtitle
source: Track and manage your assets with ease.
fa: اموال خود را به سادگی ردیابی و مدیریت کنید.

# modalCreateAccount
source: Create Account
fa: ایجاد حساب کاربری

# modalLogin
source: Login to Account
fa: ورود به حساب کاربری

# splashTitle
source: Smart Asset System
fa: سامانه هوشمند اموال

# splashLoading
source: Initializing...
fa: در حال بارگذاری اولیه...

# signUpTitle
source: Create Account
fa: ایجاد حساب کاربری

# signUpSubtitle
source: Join us and get started!
fa: به جمع ما بپیوندید!

# usernameLabel
source: Username
fa: نام کاربری

# usernameValidationError
source: Please enter your username
fa: لطفا نام کاربری خود را وارد کنید

# passwordLabel
source: Password
fa: رمز عبور

# passwordValidationError
source: Please enter your password
fa: لطفا رمز عبور خود را وارد کنید

# passwordLengthValidationError
source: Password must be at least 6 characters
fa: رمز عبور حداقل ۶ کاراکتر باشد

# confirmPasswordLabel
source: Confirm Password
fa: تکرار رمز عبور

# confirmPasswordValidationError
source: Passwords do not match
fa: رمزهای عبور یکسان نیستند

# phoneNumberLabel
source: Phone Number
fa: شماره تلفن

# phoneNumberValidationError
source: Please enter your phone number
fa: لطفا شماره تلفن را وارد کنید

# organizationNameLabel
source: Organization/Company Name
fa: نام سازمان/شرکت

# organizationIdLabel
source: Organization ID (Optional)
fa: کد اقتصادی/شناسه ملی (اختیاری)

# signUpButton
source: Sign Up
fa: ثبت نام

source: Already have an account?
fa: قبلاً ثبت‌نام کرده‌اید؟

source: Log In
fa: وارد شوید

# loginTitle
source: Welcome Back!
fa: خوش آمدید!

# loginSubtitle
source: Log in to continue.
fa: برای ادامه وارد شوید.

source: Forgot Password?
fa: فراموشی رمز عبور؟

source: Don't have an account?
fa: حساب کاربری ندارید؟

source: Sign Up Now
fa: ثبت نام کنید

# otpDialogSuccessTitle
source: Welcome!
fa: خوش آمدید!

# otpDialogSuccessMessage
source: Your account has been successfully activated.
fa: حساب کاربری شما با موفقیت فعال شد.

# otpDialogStartButton
source: Start Using The App
fa: شروع استفاده از برنامه

# otpTitle
source: OTP Verification
fa: تایید کد یکبار مصرف

# otpSubtitle
source: Enter the 6-digit code sent to your mobile number.
fa: کد ۶ رقمی ارسال شده به شماره همراه خود را وارد کنید.

# otpLabel
source: 6-Digit Verification Code
fa: کد تایید ۶ رقمی

# otpValidationError
source: Please enter the complete 6-digit code
fa: لطفا کد ۶ رقمی را به طور کامل وارد کنید

# otpResendCode
source: Resend Code
fa: ارسال مجدد کد

# otpConfirmButton
source: Confirm & Continue
fa: تایید و ادامه

# homeTitle
source: Smart Asset Management
fa: مدیریت هوشمند دارایی‌ها

# homeSubtitle
source: Asset Status Overview
fa: خلاصه وضعیت دارایی‌ها

# homeQuickActions
source: Quick Actions
fa: عملیات سریع

# homeRecentActivity
source: Recent Activity
fa: آخرین فعالیت‌ها

# homeViewAll
source: View All ({count})
fa: مشاهده همه ({count})

# homeNoAlerts
source: No important alerts to display.
fa: هیچ هشدار مهمی برای نمایش وجود ندارد.

# overviewTotalAssets
source: Total Assets
fa: کل دارایی‌ها

# overviewActive
source: Active
fa: فعال

# overviewMissing
source: Missing
fa: مفقود

# actionScanRfid
source: Scan RFID
fa: اسکن RFID

# actionReporting
source: Reporting
fa: گزارش‌گیری

# actionWorkflow
source: Workflow
fa: گردش کار

# snackGeneratingReport
source: Generating report...
fa: در حال تولید گزارش...

# snackShowingWorkflow
source: Showing workflow...
fa: نمایش گردش کار...

# snackScanSuccessful
source: RFID scan completed successfully!
fa: اسکن RFID با موفقیت انجام شد!

# snackShowDetailsFor
source: Showing details for: {assetName}
fa: نمایش جزئیات برای: {assetName}

# snackNavigatingToAllAlerts
source: Navigating to all alerts page...
fa: رفتن به صفحه همه هشدارها...

# alertIssueMissing
source: Missing
fa: مفقود شده

# alertIssueOutOfRange
source: Out of Range
fa: خارج از محدوده

# alertIssueNeedsRepair
source: Needs Repair
fa: نیاز به تعمیر

# profileUserRole
source: Senior Smart Asset System Manager
fa: مدیر ارشد سامانه هوشمند اموال

# profileUserOrgName
source: Knowledge-Based Company
fa: شرکت دانش‌بنیان

# profileUserDepartment
source: Software Development & Innovation Team
fa: تیم توسعه و نوآوری نرم‌افزار

# profileOrgInfoTitle
source: Organization Info
fa: اطلاعات سازمان

# profileOrgInfoOrgNameLabel
source: Organization Name
fa: نام سازمان

# profileOrgInfoDeptLabel
source: Unit/Department
fa: واحد/دپارتمان

# profileOrgInfoRoleLabel
source: Role
fa: سِمَت

# profileContactInfoTitle
source: Contact Information
fa: اطلاعات تماس

# profileContactInfoEmailLabel
source: Email Address
fa: آدرس ایمیل

# profileContactInfoPhoneLabel
source: Mobile Phone
fa: تلفن همراه

# profileAccountSettingsTitle
source: Account Settings
fa: تنظیمات حساب کاربری

# profileAccountSettingsChangePassword
source: Change Password
fa: تغییر رمز عبور

# snackChangePasswordSoon
source: Change password functionality will be added in future versions.
fa: عملکرد تغییر رمز عبور در نسخه‌های بعدی اضافه خواهد شد.

# profileAccountSettingsLogout
source: Log Out
fa: خروج از حساب کاربری

# snackLogoutSuccess
source: Dear user, you have been successfully logged out!
fa: کاربر گرامی، شما با موفقیت خارج شدید!

# scanPageTitle
source: RFID Scan
fa: اسکن RFID

# snackAllItemsScanned
source: All sample items have been scanned.
fa: تمام آیتم‌های نمونه اسکن شدند.

# snackScanStopped
source: Scan stopped. {count} items found.
fa: اسکن متوقف شد. {count} آیتم یافت شد.

# scanDetailsSheetType
source: Type:
fa: نوع:

# scanDetailsSheetTime
source: Scan Time:
fa: زمان اسکن:

# scanDetailsSheetDetails
source: Details:
fa: جزئیات:

# scanStatusScanning
source: Scanning...
fa: در حال اسکن...

# scanStatusReady
source: Ready to Scan
fa: آماده برای اسکن

# scanStatusFound
source: {count} items found
fa: {count} آیتم یافت شد

# scanButtonStop
source: Stop
fa: توقف

# scanButtonStart
source: Start Scan
fa: شروع اسکن

# scanEmptyState
source: No items have been scanned. Press the 'Start Scan' button to begin.
fa: هیچ آیتمی اسکن نشده است. برای شروع، دکمه 'شروع اسکن' را فشار دهید.

# assetTypeLaptop
source: Laptop
fa: لپ‌تاپ

# assetTypeHdd
source: Hard Drive
fa: هارد دیسک

# assetTypeFlash
source: Flash Memory
fa: فلش مموری

# assetTypeTool
source: Power Tool
fa: ابزار برقی

# assetTypeSafe
source: Safe
fa: گاوصندوق

# assetTypeMonitor
source: Monitor
fa: مانیتور

# assetTypePrinter
source: Printer
fa: پرینتر

# assetTypeTablet
source: Tablet
fa: تبلت

# assetTypeCamera
source: Camera
fa: دوربین عکاسی

# assetDetailCpu
source: CPU
fa: پردازنده

# assetDetailRam
source: RAM
fa: رم

# assetDetailStorage
source: Storage
fa: حافظه

# assetDetailAssetCode
source: Asset Code
fa: کد اموال

# assetDetailCapacity
source: Capacity
fa: ظرفیت

# assetDetailInterface
source: Interface
fa: رابط

# assetDetailSerial
source: Serial Number
fa: شماره سریال

# assetDetailSpeed
source: Speed
fa: سرعت

# assetDetailPartNum
source: Part Number
fa: پارت نامبر

# assetDetailVoltage
source: Voltage
fa: ولتاژ

# assetDetailModel
source: Model
fa: مدل

# assetDetailPurchaseDate
source: Purchase Date
fa: تاریخ خرید

# assetDetailDimensions
source: Dimensions
fa: ابعاد

# assetDetailPassword
source: Password
fa: رمز

# assetDetailLocation
source: Location
fa: محل استقرار

# assetDetailSize
source: Size
fa: اندازه

# assetDetailResolution
source: Resolution
fa: رزولوشن

# assetDetailRefreshRate
source: Refresh Rate
fa: نرخ بروزرسانی

# assetDetailType
source: Type
fa: نوع

# assetDetailCapability
source: Capability
fa: قابلیت

# assetDetailCartridge
source: Cartridge Status
fa: وضعیت کارتریج

# assetDetailColor
source: Color
fa: رنگ

# assetDetailStatus
source: Status
fa: وضعیت

# assetDetailContractNo
source: Contract No.
fa: شماره قرارداد

# assetDetailContractor
source: Contractor
fa: طرف قرارداد

# assetDetailExpiryDate
source: Expiry Date
fa: تاریخ انقضا

# assetDetailAmount
source: Amount
fa: مبلغ

# assetDetailRecordStatus
source: Recording Status
fa: وضعیت ضبط

# assetDetailLastService
source: Last Service
fa: آخرین سرویس

# assetDetailInkType
source: Ink Type
fa: نوع جوهر

# assetDetailConnection
source: Connection
fa: اتصال

# assetDetailDeptCode
source: Dept. Code
fa: کد بخش

# assetDetailProducer
source: Producer
fa: تهیه‌کننده

# assetDetailPeriod
source: Period
fa: دوره زمانی

# assetDetailKpi
source: Key Indicator
fa: شاخص کلیدی

# assetDetailStorageSpace
source: Storage Space
fa: فضای ذخیره‌سازی

# assetDetailOs
source: Operating System
fa: سیستم عامل

# assetDetailUserCode
source: User Code
fa: کد کاربر

# assetDetailSection
source: Section
fa: بخش

# assetDetailVersion
source: Version
fa: نسخه

# assetDetailLastReview
source: Last Review
fa: آخرین بازبینی

# assetDetailInvoiceNo
source: Invoice No.
fa: شماره فاکتور

# assetDetailSupplier
source: Supplier
fa: تامین‌کننده

# assetDetailTotalAmount
source: Total Amount
fa: مبلغ کل

# assetDetailBrightness
source: Brightness
fa: روشنایی

# assetDetailLampStatus
source: Lamp Status
fa: وضعیت لامپ

# assetDetailSoftwareUpdate
source: Last Software Update
fa: آخرین بروزرسانی نرم‌افزار

# searchPageHintText
source: Search assets...
fa: جستجو در اموال...

# searchDetailsLastModified
source: Last Modified:
fa: آخرین تغییر:

# searchDetailsMoreDetails
source: More Details:
fa: جزئیات بیشتر:

# searchStatusSearchingFor
source: Searching for '{searchText}'...
fa: درحال جستجوی '{searchText}'...

# searchEmptyStateInitial
source: Start typing to find assets, documents, or reports.
fa: برای پیدا کردن اموال، اسناد یا گزارشات شروع به تایپ کنید.

# searchEmptyStateNotFound
source: No results found for '{searchText}'.
fa: هیچ نتیجه‌ای برای '{searchText}' یافت نشد.

# searchItemTypeElectronics
source: Electronic Equipment
fa: تجهیزات الکترونیکی

# searchItemTypeLegal
source: Legal Documents
fa: اسناد حقوقی

# searchItemTypeSecurity
source: Security Equipment
fa: تجهیزات امنیتی

# searchItemTypeOffice
source: Office Machinery
fa: ماشین‌های اداری

# searchItemTypeManagement
source: Management Reports
fa: گزارشات مدیریتی

# searchItemTypeIt
source: IT Equipment
fa: تجهیزات IT

# searchItemTypeTech
source: Technical Documents
fa: مستندات فنی

# searchItemTypeFinancial
source: Financial Documents
fa: اسناد مالی

# searchItemTypeAv
source: Audio/Visual Equipment
fa: تجهیزات سمعی و بصری

# searchItemDescLaptop
source: Powerful laptop for graphic and processing tasks, available in the central warehouse.
fa: لپ‌تاپ قدرتمند برای کارهای گرافیکی و پردازشی، موجود در انبار مرکزی.

# searchItemDescContract
source: Annual contract with the CRM software development company.
fa: قرارداد سالانه با شرکت توسعه‌دهنده نرم‌افزار مدیریت ارتباط با مشتری.

# searchItemDescCamera
source: IP camera with night vision, providing full coverage of the north parking lot.
fa: دوربین IP با قابلیت دید در شب، پوشش کامل پارکینگ شمالی.

# searchItemDescPrinter
source: Color printer with scan, copy, and fax capabilities, second floor, accounting room.
fa: پرینتر رنگی با قابلیت اسکن، کپی و فکس، طبقه دوم، اتاق حسابداری.

# searchItemDescReport
source: Comprehensive analysis of the sales team's performance and comparison with Q1 targets.
fa: تحلیل جامع عملکرد تیم فروش و مقایسه با اهداف تعیین‌شده برای Q1.

# searchItemDescServer
source: Main server for daily backups of the organization's critical data.
fa: سرور اصلی برای بک‌آپ‌گیری روزانه از داده‌های حیاتی سازمان.

# searchItemDescMonitor
source: 27-inch curved monitor with a high refresh rate, used by the design team.
fa: مانیتور ۲۷ اینچ خمیده با نرخ بروزرسانی بالا، مورد استفاده تیم طراحی.

# searchItemDescManual
source: Complete guide for operating the spectrometer and electron microscope.
fa: راهنمای کامل کار با دستگاه اسپکترومتر و میکروسکوپ الکترونی.

# searchItemDescInvoice
source: Invoice for the purchase of Cisco switches and routers to upgrade the infrastructure.
fa: فاکتور مربوط به خرید سوئیچ‌ها و روترهای سیسکو برای ارتقاء زیرساخت.

# searchItemDescProjector
source: High-brightness Epson projector, suitable for large presentations.
fa: پروژکتور Epson با روشنایی بالا، مناسب برای ارائه‌های بزرگ.

# navHome
source: Home
fa: خانه

# navHomeTooltip
source: Home Page
fa: صفحه اصلی

# navScan
source: Scan RFID
fa: اسکن RFID

# navScanTooltip
source: Scan RFID
fa: اسکن RFID

# navSearch
source: Search
fa: جستجو

# navSearchTooltip
source: Search Assets
fa: جستجوی دارایی‌ها

# navProfile
source: Profile
fa: حساب

# navProfileTooltip
source: User Settings
fa: تنظیمات کاربری

# assetDetailsTitle
source: Asset Details
fa: جزئیات دارایی

# assetStatus
source: Status
fa: وضعیت

# assetStatusActive
source: Active
fa: فعال

# assetStatusInactive
source: Inactive
fa: غیرفعال

# assetStatusMissing
source: Missing
fa: مفقود

# assetIdSectionTitle
source: Identifiers
fa: شناسه‌ها

# assetIdLabel
source: Asset ID
fa: شناسه کالا

# assetRfidLabel
source: RFID Tag
fa: کد RFID

# assetRfidScan
source: Scan RFID
fa: اسکن RFID

# assetSpecsSectionTitle
source: Specifications
fa: مشخصات

# assetSpecModel
source: Model
fa: مدل

# assetSpecSerial
source: Serial Number
fa: شماره سریال

# assetSpecRegDate
source: Registration Date
fa: تاریخ ثبت

# assetSpecWarrantyEnd
source: Warranty End Date
fa: پایان گارانتی

# assetSpecLocation
source: Location
fa: مکان

# assetSpecCustodian
source: Custodian
fa: امانت‌گیرنده

# assetSpecValue
source: Value
fa: ارزش

# assetTechSpecsTitle
source: Technical Specifications
fa: مشخصات فنی

# assetDescriptionTitle
source: Description
fa: توضیحات

# assetHistoryButton
source: History
fa: تاریخچه

# assetEditButton
source: Edit
fa: ویرایش

# editAssetTitle
source: Edit Asset
fa: ویرایش دارایی

# editAlertTitle
source: Edit Confirmation
fa: تایید ویرایش

# editAlertContent
source: Are you sure you want to proceed with editing this asset?
fa: آیا می‌خواهید جزئیات این دارایی را تغییر دهید؟

# editAlertCancel
source: Cancel
fa: انصراف

# editAlertConfirm
source: Confirm
fa: بله، ویرایش

# saveChangesButton
source: Save Changes
fa: ذخیره تغییرات

# gpsLocationSectionTitle
source: GPS Location
fa: موقعیت مکانی

# statusHistoryTitle
source: Asset History
fa: تاریخچه دارایی

# statusHistoryScannedAt
source: Scanned at:
fa: اسکن در:

# statusHistoryOnDate
source: on
fa: در تاریخ

# snackScannerNotFound
source: Scanner not found or disconnected.
fa: اسکنر RFID یافت نشد!

# rfidValidationPageTitle
source: RFID Tag Validation
fa: اعتبارسنجی تگ RFID

# rfidStatusValidating
source: Validating Tag...
fa: در حال اعتبارسنجی تگ...

# rfidStatusSuccess
source: Tag Successfully Matched
fa: تگ با موفقیت تایید شد

# rfidStatusMismatch
source: Scanned Tag Mismatch
fa: تگ اسکن شده مطابقت ندارد

# rfidStatusTimeout
source: No response from tag (Timeout)
fa: پاسخی از تگ دریافت نشد

# rfidMismatchDetailsTitle
source: Details of Scanned Tag:
fa: مشخصات تگ اسکن شده:

# rfidExpectedAsset
source: Expected Asset
fa: دارایی مورد انتظار

# rfidScannedAsset
source: Scanned Asset
fa: دارایی اسکن شده

# historyPageTitle
source: Asset History
fa: تاریخچه دارایی

# historyFilterAll
source: All
fa: همه

# historyFilterStatus
source: Status
fa: وضعیت

# historyFilterLocation
source: Location
fa: مکان

# historyFilterUser
source: User
fa: کاربر

# historyFilterMaintenance
source: Maintenance
fa: تعمیر و نگهداری

# historyEventCustodianChange
source: Assigned to
fa: تحویل داده شد به

# historyEventStatusChange
source: Status changed to
fa: تغییر وضعیت به

# historyEventMaintenanceStart
source: Sent for maintenance
fa: ارسال برای تعمیر

# historyEventMaintenanceEnd
source: Returned from maintenance
fa: بازگشت از تعمیر

# historyEventScan
source: Successfully scanned at
fa: اسکن موفق در

# rfidStatusScanning
source: Scanning for Tag...
fa: در حال اسکن برای تگ...

# rfidScannedItemsTitle
source: Scanned Tags
fa: تگ‌های اسکن شده

# forgotPasswordPageTitle
source: Forgot Password
fa: بازیابی رمز عبور

# forgotPasswordPageSubtitle
source: Enter the details below to reset your password.
fa: برای بازنشانی رمز، اطلاعات زیر را وارد کنید.

# emailOrPhoneLabel
source: Email or Phone Number
fa: ایمیل یا شماره همراه

# emailOrPhoneValidationError
source: Please enter your email or phone number.
fa: لطفا ایمیل یا شماره همراه را وارد کنید.

# sendCodeButton
source: Send Code
fa: ارسال کد

# codeSentSnackbar
source: Code sent successfully!
fa: کد با موفقیت ارسال شد!

# changePasswordButton
source: Change Password
fa: تغییر رمز عبور

# passwordChangedSuccessSnackbar
source: Your password has been changed successfully!
fa: رمز عبور شما با موفقیت تغییر کرد!

# reportsPageTitle
source: Reports & Analytics
fa: گزارشات و آمار

# reportDateFilter
source: Report Timeframe
fa: بازه زمانی گزارش

# dateDaily
source: Daily
fa: روزانه

# dateWeekly
source: Weekly
fa: هفتگی

# dateMonthly
source: Monthly
fa: ماهانه

# dateQuarterly
source: Quarterly
fa: سه ماهه

# dateSixMonth
source: 6-Month
fa: شش ماهه

# dateYearly
source: Yearly
fa: سالانه

# categoryDistributionTitle
source: Asset Category Distribution
fa: پراکندگی دسته‌بندی اموال

# categoryElectronics
source: Electronics
fa: تجهیزات الکترونیکی

# categoryFurniture
source: Furniture
fa: مبلمان

# categoryVehicles
source: Vehicles
fa: وسایل نقلیه

# categoryTools
source: Tools
fa: ابزارآلات

# scanActivityTitle
source: Scan Activity
fa: فعالیت اسکن

# topScannedTitle
source: Top Scanned Items
fa: بیشترین اسکن‌شده‌ها

# exportButton
source: Export
fa: خروجی

# exportingSnackbar
source: Preparing export...
fa: در حال آماده‌سازی خروجی...

# workflowPageTitle
source: Workflows & Activities
fa: گردش کار و فعالیت‌ها

# workflowSectionNewRequests
source: New Requests
fa: درخواست‌های جدید

# workflowSectionInProgress
source: In Progress
fa: در دست اقدام

# workflowSectionCompleted
source: Completed
fa: تکمیل شده

# workflowTaskTransfer
source: Transfer
fa: انتقال

# workflowTaskMaintenance
source: Maintenance
fa: تعمیرات

# workflowTaskDecommission
source: Decommission
fa: از رده خارج کردن

# workflowTaskFrom
source: From:
fa: از:

# workflowTaskTo
source: To:
fa: به:

# workflowTaskAsset
source: Asset:
fa: دارایی:

# workflowTaskDate
source: Date:
fa: تاریخ:

# workflowFilterAll
source: All Activities
fa: همه فعالیت‌ها

# workflowFilterTransfers
source: Transfers
fa: انتقالات

# workflowFilterEdits
source: Edits
fa: ویرایش‌ها

# workflowFilterStatusChanges
source: Status Changes
fa: تغییرات وضعیت

# workflowActionAdded
source: {adminName} added a new asset:
fa: {adminName} یک دارایی جدید اضافه کرد:

# workflowActionEdited
source: {adminName} edited:
fa: {adminName} ویرایش کرد:

# workflowActionTransferred
source: {adminName} transferred:
fa: {adminName} منتقل کرد:

# workflowActionChangedStatus
source: {adminName} changed status:
fa: {adminName} وضعیت را تغییر داد:

# workflowActionOfflineScan
source: {adminName} offline status:
fa: {adminName} افلاین وضعیت:

# workflowDetailTo
source: To: {user}
fa: به: {user}

# workflowDetailFrom
source: From: {user}
fa: از: {user}

# workflowDetailToStatus
source: To: "{status}"
fa: به: "{status}"

# dateRangeLabel
source: Selected Date Range:
fa: بازه زمانی انتخاب شده:

# dateRangeAllTime
source: All Time
fa: تمام زمان‌ها

# syncButton
source: Sync
fa: همگام‌سازی

# assetListPageTitle
source: Asset List
fa: لیست دارایی‌ها

# tabAll
source: All
fa: همه

# tabElectronics
source: Electronics
fa: الکترونیکی

# tabFurniture
source: Furniture
fa: اثاثیه

# tabVehicles
source: Vehicles
fa: نقلیه

# tabTools
source: Tools
fa: ابزارآلات

# fabAddAssetTooltip
source: Add New Asset
fa: افزودن دارایی جدید

# emptyAssetState
source: No assets found for this filter.
fa: هیچ مالی با این فیلتر یافت نشد.

source: Search Assets
fa: جستجوی دارایی‌ها

# navAssetList
source: Assets
fa: دارایی ها

# navAssetListToolpip
source: Shows total Assets
fa: نمایش کله دارایی ها

# recentActivityPageTitle
source: Recent Activities
fa: آخرین فعالیت‌ها

# filterButtonTooltip
source: Filter
fa: فیلتر کردن

# refreshButtonTooltip
source: Refresh
fa: بارگذاری مجدد

# buySubscriptionTitle
source: Activate Your Subscription
fa: اشتراک خود را فعال کنید

# buySubscriptionSubtitle
source: To get full access to all features, please purchase your subscription.
fa: برای دسترسی کامل به تمام امکانات، لطفا اشتراک خود را تهیه کنید.

# buySubscriptionButton
source: Proceed to Payment
fa: پرداخت و فعال‌سازی

# purchaseCompleteButton
source: I Have Completed The Payment
fa: پرداخت را انجام دادم

# testTheAppButton
source: I just want to test the app
fa: می‌خواهم برنامه را تست کنم

# checkSubscriptionTitle
source: Complete Your Purchase
fa: تکمیل فرآیند خرید

# checkSubscriptionSubtitle
source: Your payment link is ready. After completing the payment, press the confirmation button.
fa: لینک پرداخت شما آماده است. پس از تکمیل پرداخت، دکمه تایید را فشار دهید.

# openPaymentLink
source: Open Payment Page
fa: باز کردن صفحه پرداخت

# paymentSuccessfulSnackbar
source: Your payment was successfully confirmed! Welcome aboard.
fa: پرداخت شما با موفقیت تایید شد! به سامانه خوش آمدید.

# checkingPaymentSnackbar
source: Checking payment status...
fa: در حال بررسی وضعیت پرداخت...

# onboardingProgress
source: Registration Progress
fa: تکمیل ثبت‌نام

# roleSelectionTitle
source: Choose Your Role
fa: نقش خود را انتخاب کنید

# roleSelectionSubtitle
source: Do you want to create a new organization or join an existing one?
fa: می‌خواهید یک سازمان جدید ایجاد کنید یا به یک سازمان موجود بپیوندید؟

# createCompanyButton
source: Create New Organization
fa: ایجاد سازمان جدید

# joinCompanyButton
source: Join Existing Organization
fa: عضویت در سازمان موجود

# myCompaniesTitle
source: My Organizations
fa: سازمان‌های من

# myCompaniesSubtitle
source: You are not currently a member of any organization. To be active in the system, you must be added by an organization's administrator.
fa: در حال حاضر شما عضو هیچ سازمانی نیستید. برای فعالیت در سامانه، باید توسط مدیر یک سازمان اضافه شوید.

# myCompaniesWaiting
source: Waiting for approval...
fa: در انتظار تایید...

# myCompaniesRefresh
source: Check Status Again
fa: بررسی مجدد وضعیت

# createCompanyTitle
source: Create Your Company
fa: ایجاد شرکت شما

# createCompanySubtitle
source: Enter the details to create your company.
fa: جزئیات را برای ایجاد شرکت خود وارد کنید.

# companyNameLabel
source: Company Name
fa: نام شرکت

# companyIndustryLabel
source: Industry
fa: صنعت

# companyAddressLabel
source: Address
fa: آدرس

# createCompanyAction
source: Create Company
fa: ایجاد شرکت

# onboardingCompleteTitle
source: Welcome Aboard!
fa: خوش آمدید!

# onboardingCompleteSubtitle
source: Congratulations! You've successfully created your company. Now, select a company to get started.
fa: تبریک! شما با موفقیت شرکت خود را ایجاد کردید. حالا یک شرکت را برای شروع انتخاب کنید.

# goToDashboardButton
source: List of Companies
fa: لیست شرکت ها

# switchCompanyPageTitle
source: Switch Company
fa: تغییر شرکت

# companyRoleOwner
source: Owner
fa: مالک

# companyRoleAdmin
source: Admin
fa: مدیر

# companyRoleMember
source: Member
fa: عضو

# activeCompanyTooltip
source: This is the active company
fa: این شرکت فعال است

# switchToCompanySnackbar
source: Switched to {companyName}
fa: به شرکت {companyName} تغییر یافت

# loanDashboardTitle
source: Loan Dashboard
fa: داشبورد وام

# myLoansTab
source: My Loans
fa: وام‌های من

# loanedOutTab
source: Loaned Out
fa: امانت‌داده‌شده‌ها

# createLoanPageTitle
source: Create Loan
fa: ایجاد وام

# createLoanPageSubtitle
source: Scan an asset and recipient to create a new loan
fa: برای ایجاد وام جدید، یک دارایی و گیرنده را اسکن کنید

# selectAssetFieldLabel
source: Select Asset
fa: انتخاب دارایی

# selectUserFieldLabel
source: Select Recipient
fa: انتخاب گیرنده

# externalRecipientFieldLabel
source: External Recipient (Optional)
fa: تحویل گیرنده خارجی (اختیاری)

# returnDateLabel
source: Return Date
fa: تاریخ بازگشت

# notesLabel
source: Notes
fa: یادداشت‌ها

# createLoanButton
source: Create Loan
fa: ایجاد وام
